# -*- coding:utf-8 -*-

cn_jp=[
u"宫兰边駒变矶冈纱单弹对姬举戸厅团稳压隐栈滨迟齿处传从递读恶儿贰发废丰关观广归怀坏欢绘击鸡剂济继价俭检剑奖经据觉矿扩览劳乐垒两猎灵龄龙泷卖满恼脑酿齐气钱纤轻驱权劝让荣涩烧摄绳实释兽丝肃铁听图为围药艺译驿应樱萤营杂赞脏择泽斋战证铸专转庄总纵鉴讲绞矫较阶节贺红后护华话缓谋亩纳难拟鸟宁泪类离历历隶伪牺戏显险县晓续亚亚严盐验样谣爱罢败颁饱报贝备辈笔币闭编标层产长场肠偿车宾钵补财仓侧测缔电钓顶订锭东纷坟奋愤风缝肤诘洁结紧谨进惊还环挥辉贿货获获彻陈诚惩冲铳丑动冻栋斗笃锻队负妇复复赋缚该干干础创锤纯词赐错钝夺额饿罚阀烦绀刚纲钢个个阁给达带贷诞导岛敌饭范贩访纺飞费贡沟规轨贵过汉鲸竞镜纠剧绢绝祸饥机积绩级极启迁铅谦缲桥亲伦论轮罗络马买软锐润伞丧骚扫讼诉岁孙损缩锁军开壳课垦恳库几计记纪际坚间倾请庆穷确热认贸门梦绵灭鸣铭杀缮伤赏绍设舍态坛昙谈叹汤讨针侦诊阵镇征只拜辨瓣辩藏乘粹资谘渍组醉夸块宽赖濑栏滥监茧简见荐舰渐协胁谢兴许绪轩务误雾习袭玺系绅审圣胜师诗时誊腾题调统铜头亿义忆议阴银饮缘远愿约阅跃云织执职纸志制质稻叠佛拂罐惠姬农浓诺盘赔喷贫连练粮疗邻临赁悬选勋寻训颜扬细辖吓鲜闲贤铣识势饰试视适书涂驮顽网违维伟拥优忧邮犹诱鱼运载暂则责贼赠终钟种众轴诸假娘缺壤剩收髓频评朴仆铺谱骑铃领陆虏录虑绿阳养业叶谒仪遗现线宪乡详响项输术树帅顺说饲纬卫纹闻问涡无渔语狱预谕园员诈债张帐胀诏贞贮驻筑妆坠准浊碎穗溪陷摇壹豫",
u"宮蘭辺驹変磯岡紗単弾対姫挙户庁団穏圧隠桟浜遅歯処伝従逓読悪児弍発廃豊関観広帰懐壊歓絵撃鶏剤済継価倹検剣奨経拠覚鉱拡覧労楽塁両猟霊齢竜滝売満悩脳醸斉気銭繊軽駆権勧譲栄渋焼摂縄実釈獣糸粛鉄聴図為囲薬芸訳駅応桜蛍営雑賛臓択沢斎戦証鋳専転荘総縦鑑講絞矯較階節賀紅後護華話緩謀畝納難擬鳥寧涙類離歴暦隷偽犠戯顕険県暁続亞亜厳塩験様謡愛罷敗頒飽報貝備輩筆幣閉編標層産長場腸償車賓鉢補財倉側測締電釣頂訂錠東紛墳奮憤風縫膚詰潔結緊謹進驚還環揮輝賄貨獲穫徹陳誠懲沖銃醜動凍棟鬪篤鍛隊負婦復複賦縛該乾幹礎創錘純詞賜錯鈍奪額餓罸閥煩紺剛綱鋼個箇閣給達帶貸誕導島敵飯範販訪紡飛費貢溝規軌貴過漢鯨競鏡糾劇絹絶禍飢機積績級極啓遷鉛謙繰橋親倫論輪羅絡馬買軟鋭潤傘喪騒掃訟訴歳孫損縮鎖軍開殼課墾懇庫幾計記紀際堅間傾請慶窮確熱認貿門夢綿滅鳴銘殺繕傷賞紹設捨態壇曇談嘆湯討針偵診陣鎮徴隻拝弁弁弁蔵乗粋資諮漬組酔誇塊寬頼瀬欄濫監繭簡見薦艦漸協脅謝興許緒軒務誤霧習襲璽係紳審聖勝師詩時謄騰題調統銅頭億義憶議陰銀飲縁遠願約閲躍雲織執職紙誌製質稲畳仏払缶恵姫農濃諾盤賠噴貧連練糧療隣臨賃懸選勲尋訓顔揚細轄嚇鮮閑賢銑識勢飾試視適書塗馱頑網違維偉擁優憂郵猶誘魚運載暫則責賊贈終鍾種衆軸諸仮嬢欠壌剰収髄頻評樸僕舗譜騎鈴領陸虜録慮緑陽養業葉謁儀遺現線憲郷詳響項輸術樹帥順説飼緯衛紋聞問渦無漁語獄預諭園員詐債張帳脹詔貞貯駐築粧墜準濁砕穂渓陥揺壱予",
]

def cn2jp(cn):
    try:
        i = cn_jp[0].index(cn)
    except Exception, e:
        return cn
    return cn_jp[1][i]

def jp2cn(jp):
    try:
        i = cn_jp[1].index(jp)
    except Exception, e:
        return jp
    return cn_jp[0][i]

def identicalcheck():
    for i in xrange(len(cn_jp[0])):
        if cn_jp[0][i] == cn_jp[1][i] :
            print u"No.%d : %s" % (i, cn_jp[0][i])
        pass
    pass
